#+OPTIONS: toc:nil hidestars indent inlineimages
#+OPTIONS: ^:nil
#+AUTHOR: Jeremy Compostella <jeremy.compostella@gmail.com>
#+EXPORT_FILE_NAME: README.md
#+TITLE: Solar Power usage optimization in a residential home

#+name: monthly-data
#+begin_src python :session :exports none :results output
  from dateutil import parser
  from src.tools import get_database

  def dict_factory(cursor, row):
      data = {}
      for idx, col in enumerate(cursor.description):
          data[col[0]] = row[idx]
      return data

  def total(record):
      return sum([v for k, v in record.items() \
                  if k not in ['net', 'solar', 'from_grid',
                               'to_grid', 'title', 'local']])

  def monthly_data():
      months = {}
      with get_database() as database:
          database.row_factory = dict_factory
          cursor = database.cursor()
          req = 'SELECT * FROM daily_energy'
          cursor.execute(req)
          daily_energy = cursor.fetchall()
      for day in daily_energy:
          month = parser.parse(day['timestamp']).strftime("%B\n%Y")
          if month in months:
              months[month] = {k:months[month][k] + v \
                               for k, v in day.items() \
                               if k != 'timestamp'}
          else:
              months[month] = {k:v for k, v in day.items() if k != 'timestamp'}
      for month in months:
          record = months[month]
          record['other'] = -(total(record) + record['solar'] - record['net'])
          for key, value in record.items():
              record[key] = abs(value)
          record['hvac'] = record['a_c'] + record['air_handler']
          record['local'] = record['solar'] - record['to_grid']
          del record['a_c']
          del record['air_handler']
          record['title'] = '%s' % month
      return list(months.values())

  print(monthly_data())
#+end_src
#+RESULTS: monthly-data
#+name: usage-share
#+begin_src python :session :exports none :results value :var data=monthly-data devices="ev,hvac,water_heater"
  data = eval(data)
  total = sum([record['local'] + record['from_grid'] for record in data])
  # devices = sum(sum(record[d] for d in ['ev', 'hvac', 'water_heater']) \
  devices = sum(sum(record[d] for d in devices.split(',')) \
		for record in data)
  '%d%%' % round(100 * devices / total)
#+end_src
